"""
Задача 02-16. Время года

Прочитайте порядковый номер месяца (целое число). Выведите время года:

- 12, 1, 2 — «зима»;
- 3, 4, 5 — «весна»;
- 6, 7, 8 — «лето»;
- 9, 10, 11 — «осень»;
- любой другой номер — «ошибка».

Пример
------
Ввод:
4
Вывод:
весна
"""

# TODO: прочитайте номер месяца и выведите время года
month = int(input())

if month == 12 or month == 1 or month == 2:
    print('зима')
elif 3 <= month <= 5:
    print('весна')
elif 6 <= month <= 8:
    print('лето')
elif 9 <= month <= 11:
    print('осень')
else:
    print('ошибка')

